Revit 2026 API

# DimensionValueString Property

---

The dimension value as a user visible string.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ValueString { get; }
```
```vb
Public ReadOnly Property ValueString As String
	Get
```
```cpp
public:
property String^ ValueString {
	String^ get ();
}
```
```fsharp
member ValueString : string with get
```

#### Property Value

String

This property always return  if this is a spot dimension, or it is a linear dimension with more than one segments.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace